Author: Jase Banta \
Date: 2024-12-06 \
Description: The following python codes are written for an application to University of Chicago M.S. Applied Data Science program. \
1. I shall write a function to randomly select 20% from `bank-additional-full.csv` to form `.csv`.
2. I want to I want to perform some data transformation and standarization.
- Add a new column for age range
- remove hidden characters from `job` column
- Create dict in `Education`
- Treat `unknown` value as None type for columns `Default`, `Housing`, `Loan`.
- Transform columns to binary `Default`, `Housing`, `Loan`, `Y` 
- Calculate basic stats:
    - overall martial status, success rate, job categories, education level, house 
    - Age distribution (visualization) colored by marital status
    - Job and housing 

Moro, S., P. Rita, and P. Cortez. 2014. Bank Marketing. UCI Machine Learning Repository. https://doi.org/10.24432/C5K306.

In [67]:
import csv, random
import pandas as pd
import numpy as np

class Utility:
    def __init__(self):
        pass

    def random_select(self, source: str, target: str, size: float) -> str:
        with open(source, 'r') as file:
            reader = csv.reader(file, delimiter= ';')
            header = next(reader)
            data = list(reader)
            size = round(size * len(data))
            sample_rows = random.sample(data, min(size, len(data)))

        with open(target, 'w', newline= '') as outfile:
            writer = csv.writer(outfile, delimiter= ',')
            writer.writerow(header)
            writer.writerows(sample_rows)
        
        return target

    def formatEducation(self, value):
        pass
    
    def transformBinary(self, df, columns: list):
        mapping = {
            'yes': True,
            'no': False,
            'unknown': np.nan
        }
        for column in columns:
            df[column] = df[column].replace(mapping)

        return df
    
    def AgeMasking(self, age: int):
        age_gorup = np.nan
        if age < 18:
            age_gorup = '< 18'
        elif 18 <= age < 37:
            age_gorup = '18-36'
        elif 37 <= age < 55:
            age_gorup = '37-54'
        elif 54 <= age < 73:
            age_gorup = '54-72'
        elif 73 <= age < 91:
            age_gorup = '73-90'
        elif age >= 90:
            age_gorup = '90+'
        return age_gorup

In [31]:
source='bank-additional-full.csv'
target='bank-sample.csv'
size = 0.1
with open(source, 'r') as file:
    reader = csv.reader(file, delimiter= ';')
    header = next(reader)
    data = list(reader)
    size = round(size * len(data))
    sample_rows = random.sample(data, min(size, len(data)))

with open(target, 'w', newline= '') as outfile:
    writer = csv.writer(outfile, delimiter= ',')
    writer.writerow(header)
    writer.writerows(sample_rows)

In [68]:
import pandas as pd

util = Utility()
sample = util.random_select(source='bank-additional-full.csv', target='bank-sample.csv', size=0.15)
data = pd.read_csv(sample)
data.head()

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,...,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y
0,34,technician,married,professional.course,no,yes,no,cellular,sep,wed,...,2,999,0,nonexistent,-3.4,92.379,-29.8,0.813,5017.5,yes
1,48,services,married,high.school,unknown,yes,no,telephone,may,wed,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.856,5191.0,no
2,46,blue-collar,divorced,basic.9y,no,no,no,cellular,apr,wed,...,1,999,1,failure,-1.8,93.075,-47.1,1.445,5099.1,no
3,37,technician,single,university.degree,unknown,yes,no,cellular,jul,wed,...,2,999,0,nonexistent,1.4,93.918,-42.7,4.957,5228.1,no
4,31,services,single,high.school,no,yes,no,cellular,may,mon,...,1,999,0,nonexistent,-1.8,92.893,-46.2,1.299,5099.1,no

In [35]:
data['job'].apply(lambda val: val.rstrip(".,!?"))

0       blue-collar
1       blue-collar
2          services
3             admin
4             admin
           ...
6173        retired
6174     technician
6175          admin
6176     technician
6177       services
Name: job, Length: 6178, dtype: object

In [38]:
data["education"].apply(lambda val: val.replace('.', '-'))

0               high-school
1                  basic-9y
2                  basic-9y
3               high-school
4         university-degree
               ...
6173    professional-course
6174    professional-course
6175            high-school
6176      university-degree
6177            high-school
Name: education, Length: 6178, dtype: object

In [ ]:
new_data['age_group']=new_data['age'].apply(lambda val: util.AgeMasking(val))

In [47]:
new_data = util.transformBinary(df = data, columns = ['default', 'housing','loan','y'])
new_data

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,...,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y
0,22,services,married,basic.9y,False,True,False,cellular,jul,tue,...,2,999,0,nonexistent,1.4,93.918,-42.7,4.961,5228.1,False
1,46,admin.,divorced,high.school,False,False,False,telephone,may,fri,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,False
2,30,entrepreneur,married,professional.course,False,False,False,telephone,may,wed,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.858,5191.0,False
3,31,admin.,single,university.degree,False,False,False,telephone,may,wed,...,3,999,0,nonexistent,1.1,93.994,-36.4,4.859,5191.0,False
4,33,services,single,high.school,False,True,False,cellular,may,thu,...,2,999,0,nonexistent,-1.8,92.893,-46.2,1.266,5099.1,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
6173,32,blue-collar,single,high.school,NaN,True,False,cellular,may,wed,...,3,999,0,nonexistent,-1.8,92.893,-46.2,1.281,5099.1,False
6174,50,admin.,married,university.degree,False,True,False,telephone,may,fri,...,4,999,0,nonexistent,1.1,93.994,-36.4,4.864,5191.0,False
6175,54,technician,married,university.degree,False,True,False,cellular,aug,fri,...,1,4,1,success,-2.9,92.201,-31.4,0.881,5076.2,False
6176,40,technician,married,professional.course,NaN,True,False,telephone,may,thu,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.860,5191.0,False
6177,48,services,divorced,high.school,False,False,True,telephone,jul,mon,...,7,999,0,nonexistent,1.4,93.918,-42.7,4.960,5228.1,False

In [48]:
new_data['age'].describe()

count    6178.000000
mean       39.881353
std        10.274113
min        17.000000
25%        32.000000
50%        38.000000
75%        47.000000
max        98.000000
Name: age, dtype: float64

Calculate stats

In [50]:
new_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6178 entries, 0 to 6177
Data columns (total 21 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             6178 non-null   int64
 1   job             6178 non-null   object
 2   marital         6178 non-null   object
 3   education       6178 non-null   object
 4   default         4860 non-null   object
 5   housing         6012 non-null   object
 6   loan            6012 non-null   object
 7   contact         6178 non-null   object
 8   month           6178 non-null   object
 9   day_of_week     6178 non-null   object
 10  duration        6178 non-null   int64
 11  campaign        6178 non-null   int64
 12  pdays           6178 non-null   int64
 13  previous        6178 non-null   int64
 14  poutcome        6178 non-null   object
 15  emp.var.rate    6178 non-null   float64
 16  cons.price.idx  6178 non-null   float64
 17  cons.conf.idx   6178 non-null   float64
 18  euribor3m       6178 non-null   float64
 19  nr.employed     6178 non-null   float64
 20  y               6178 non-null   bool
dtypes: bool(1), float64(5), int64(5), object(10)
memory usage: 971.5+ KB

In [66]:
new_data.pivot_table(
    values='duration', 
    index=['education', 'housing'], 
    columns=['marital'],
    aggfunc='mean',
    fill_value="Null"
    )

marital                        divorced     married      single     unknown
education           housing
basic.4y            False    224.205882  293.350427   225.37037       673.0
                    True      243.04878  264.042056  153.095238        Null
basic.6y            False    224.833333  258.000000  205.961538        Null
                    True          202.0  248.085714  278.074074        Null
basic.9y            False       292.875  258.977918  259.878049        Null
                    True     262.065217  228.654723      300.16        Null
high.school         False    265.243902  275.036011  252.052356       305.5
                    True     288.933962  268.229426  254.109023       155.0
illiterate          False          Null  460.000000        Null        Null
                    True           Null  838.000000        Null        Null
professional.course False    144.068966  268.505000  217.208791       112.0
                    True          229.0  249.304000  327.016667        Null
university.degree   False    205.785714  232.148064  264.494915        77.0
                    True     251.737374  258.604288   256.82235        Null
unknown             False      231.3125  227.392405     278.375        Null
                    True         377.75  270.964706       324.4  288.333333

In [72]:
new_data['age_group']=new_data['age'].apply(lambda val: util.AgeMasking(val))